Use test;

DROP TABLE IF EXISTS part;

CREATE TABLE part (
  `ID` INT NOT NULL AUTO_INCREMENT,
  `PART_NAME` VARCHAR(45) NOT NULL,
  `NECESSITY` BIT(1) NOT NULL,
  `AMOUNT` INT NOT NULL,
  PRIMARY KEY (`ID`))
ENGINE = InnoDB
DEFAULT CHARACTER SET = utf8;

INSERT INTO part (`PART_NAME`,`NECESSITY`,`AMOUNT`)
    VALUES ("процессор", 1, 23),
      ("материнская плата", 1, 16),
      ("оперативная память", 1, 22),
      ("жесткий диск", 1, 11),
      ("видеокарта", 0, 9),
      ("корпус", 1, 12),
      ("блок питания", 1, 8),
      ("кулер для процессора", 1, 15),
      ("оптический привод", 0, 3),
      ("звуковая карта", 0, 1),
      ("сетевая карта", 0, 2),
      ("термопаста", 0, 57),
      ("мышка", 0, 31),
      ("клавиатура", 0, 25),
      ("колонки", 0, 14),
      ("принтер", 0, 4),
      ("монитор", 0, 12),
      ("сканер", 0, 3),
      ("роутер", 0, 16),
      ("вентилятор", 0, 22),
      ("веб-камера", 0, 16),
      ("коврик для мышки", 0, 54),
      ("наушники", 0, 12),
      ("микрофон", 0, 1),
      ("сетевой фильтр", 0, 18),
      ("ИБП", 0, 6),
      ("USB-накопитель", 0, 64),
      ("Wi-Fi адаптер", 0, 9),
      ("кабель (в ассортименте)", 0, 238),
      ("Windows 10 Ultimate Edition", 1, 42);